import numpy as np

dataSet = [
        # 17个样本，6个属性
        ['青绿', '蜷缩', '浊响', '清晰', '凹陷', '硬滑', '好瓜'],
        ['乌黑', '蜷缩', '沉闷', '清晰', '凹陷', '硬滑', '好瓜'],
        ['乌黑', '蜷缩', '浊响', '清晰', '凹陷', '硬滑', '好瓜'],
        ['青绿', '蜷缩', '沉闷', '清晰', '凹陷', '硬滑', '好瓜'],
        ['浅白', '蜷缩', '浊响', '清晰', '凹陷', '硬滑', '好瓜'],
        ['青绿', '稍蜷', '浊响', '清晰', '稍凹', '软粘', '好瓜'],
        ['乌黑', '稍蜷', '浊响', '稍糊', '稍凹', '软粘', '好瓜'],
        ['乌黑', '稍蜷', '浊响', '清晰', '稍凹', '硬滑', '好瓜'],
        ['乌黑', '稍蜷', '沉闷', '稍糊', '稍凹', '硬滑', '坏瓜'],
        ['青绿', '硬挺', '清脆', '清晰', '平坦', '软粘', '坏瓜'],
        ['浅白', '硬挺', '清脆', '模糊', '平坦', '硬滑', '坏瓜'],
        ['浅白', '蜷缩', '浊响', '模糊', '平坦', '软粘', '坏瓜'],
        ['青绿', '稍蜷', '浊响', '稍糊', '凹陷', '硬滑', '坏瓜'],
        ['浅白', '稍蜷', '沉闷', '稍糊', '凹陷', '硬滑', '坏瓜'],
        ['乌黑', '稍蜷', '浊响', '清晰', '稍凹', '软粘', '坏瓜'],
        ['浅白', '蜷缩', '浊响', '模糊', '平坦', '硬滑', '坏瓜'],
        ['青绿', '蜷缩', '沉闷', '稍糊', '稍凹', '硬滑', '坏瓜']
    ]


x=np.array(dataSet)
'''

#输出矩阵的行数与列数
print(x.shape)

#输出行数
print(len(dataSet))
print(x.shape[0])
print(len(x))

print('\n')
#输出列数
print(x.shape[1])

#输出维度
print(x.ndim)
print
###
'''


#以原油矩阵的%70数据生成新的矩阵：
#思路1：重新建立矩阵
'''
cd=x.shape[0]
cd=cd*0.7
cd=int(cd)
cd1=int(x.shape[1])
#data1=np.eye(x.shape);
data2=np.empty([16,7])

for i in range(cd):
    data2[i]=dataSet[i]
#'''



#思路2：复制并将新的矩阵减少30%

data2=dataSet
cd=x.shape[0]
cd1=cd*0.7
cd1=int(cd1)
'''
for i in range(cd1-1,cd-1):
        data2.remove(data2[i])
#'''
#'''
i=cd-1
while i>=cd1:
        data2.remove(data2[i])
        i=i-1
#'''

print(data2[1])
