#数据库：
import pymysql
#矩阵：
import numpy as np
new_array = np.zeros((5,3))

def to_DB(a,b,c):#a为数据库名；b为表名;c为矩阵
    # ___________________________________________________数据库相关
    # 链接数据库：
    db = pymysql.connect(
    user="root",
    password="12345678",
    host="127.0.0.1",
    # db="DT_K",
    charset="utf8mb4",
    cursorclass=pymysql.cursors.DictCursor
    )
    cursor = db.cursor()
    # """
    # 输出watermelon表的所有信息：
    # cursor.execute('use sql_pyc')
    # cursor.execute("select * from watermelon")
    cursor.execute("use "+a)
    # cursor.execute("select * from "+b)
    ac=np.array(c)

    '''
    try:
        # cursor.executemany("insert into student(sno,Sname,Ssex,Sage,Sdept) values(%s,%s,%s,%s,%s)", in1)
        # 执行sql语句,插入多条数据
        # ss1=("insert into ",b,"(",c[0],") values(%s",((ac.shape[1] - 1)*",%s"),")")
        cursor.executemany("insert into stu_w1(样本, 奖学金情况, 入学-毕业成绩变动大小, 曾参与项目级别, 参与社团数, 成绩, 兼职, 就业状况) values(%s,%s,%s,%s,%s,%s,%s,%s)", c)
        db.commit()
        print("AAA")
        # 提交数据
    except:
        print("BBB")
        db.rollback()
        # 发生错误时回滚
    #'''
    cursor.executemany("insert into stu_w1 values(%s,%s,%s,%s,%s,%s,%s,%s)",c)
    db.commit()

    # for i in c:
    #     if(c[0]==i):
    #         continue
    #     in1=[]
    #     for j in i:
    #         # in1.append(c[i][j])
    #         cursor.execute("insert into", b,"(",c[0],") values(%s",((ac.shape[1]-2)*',%s'),")",j)
    # #cursor.execute("insert into")

    # 退出数据库：
    db.close();


#'''
#——————————————————————————————————————————————————————————————————————————————————————————————将矩阵输入到数据库
dt = [
    ['样本', '奖学金情况', '入学-毕业成绩变动大小', '曾参与项目级别', '参与社团数', '成绩', '兼职', '就业状况'],
    ['样本1', '院/系级', '20%', '无', '1-2', '30%', '是', '本专业'],
    ['样本2', '校级', '20%', '省级/国家级', '1-2', '30%', '是', '本专业'],
    ['样本3', '校级', '20%', '无', '1-2', '30%', '是', '本专业'],
    ['样本4', '院/系级', '20%', '省级/国家级', '1-2', '30%', '是', '本专业'],
    ['样本5', '省级/国家级', '20%', '无', '1-2', '30%', '是', '本专业'],
    ['样本6', '院/系级', '10%', '无', '1-2', '50%', '否', '本专业'],
    ['样本7', '校级', '10%', '无', '0', '50%', '否', '本专业'],
    ['样本8', '校级', '10%', '无', '1-2', '50%', '是', '本专业'],
    ['样本9', '校级', '10%', '省级/国家级', '0', '50%', '是', '非本专业'],
    ['样本10', '院/系级', '40%', '校/市级', '1-2', '10%', '否', '非本专业'],
    ['样本11', '省级/国家级', '40%', '校/市级', '3+', '10%', '是', '非本专业'],
    ['样本12', '省级/国家级', '20%', '无', '3+', '10%', '否', '非本专业'],
    ['样本13', '院/系级', '10%', '无', '0', '30%', '是', '非本专业'],
    ['样本14', '省级/国家级', '10%', '省级/国家级', '0', '30%', '是', '非本专业'],
    ['样本15', '校级', '10%', '无', '1-2', '50%', '否', '非本专业'],
    ['样本16', '省级/国家级', '20%', '无', '3+', '10%', '是', '非本专业'],
    ['样本17', '院/系级', '20%', '省级/国家级', '0', '50%', '是', '非本专业']
]

dt1 = [
    # ('样本', '奖学金情况', '入学-毕业成绩变动大小', '曾参与项目级别', '参与社团数', '成绩', '兼职', '就业状况'),
    ('样本1', '院/系级', '20%', '无', '1-2', '30%', '是', '本专业'),
    ('样本2', '校级', '20%', '省级/国家级', '1-2', '30%', '是', '本专业'),
    ('样本3', '校级', '20%', '无', '1-2', '30%', '是', '本专业'),
    ('样本4', '院/系级', '20%', '省级/国家级', '1-2', '30%', '是', '本专业'),
    ('样本5', '省级/国家级', '20%', '无', '1-2', '30%', '是', '本专业'),
    ('样本6', '院/系级', '10%', '无', '1-2', '50%', '否', '本专业'),
    ('样本7', '校级', '10%', '无', '0', '50%', '否', '本专业'),
    ('样本8', '校级', '10%', '无', '1-2', '50%', '是', '本专业'),
    ('样本9', '校级', '10%', '省级/国家级', '0', '50%', '是', '非本专业'),
    ('样本10', '院/系级', '40%', '校/市级', '1-2', '10%', '否', '非本专业'),
    ('样本11', '省级/国家级', '40%', '校/市级', '3+', '10%', '是', '非本专业'),
    ('样本12', '省级/国家级', '20%', '无', '3+', '10%', '否', '非本专业'),
    ('样本13', '院/系级', '10%', '无', '0', '30%', '是', '非本专业'),
    ('样本14', '省级/国家级', '10%', '省级/国家级', '0', '30%', '是', '非本专业'),
    ('样本15', '校级', '10%', '无', '1-2', '50%', '否', '非本专业'),
    ('样本16', '省级/国家级', '20%', '无', '3+', '10%', '是', '非本专业'),
    ('样本17', '院/系级', '20%', '省级/国家级', '0', '50%', '是', '非本专业')
]
# print(dt[0])
to_DB("sql_pyc","stu_w1",dt1)
#'''



'''

t1=['样本17', '院/系级', '20%', '省级/国家级', '0', '50%', '是', '非本专业']
t=[('样本17', '院/系级', '20%', '省级/国家级', '0', '50%', '是', '非本专业'),('样本16', '省级/国家级', '20%', '无', '3+', '10%', '是', '非本专业')]
print(type(dt))
print(t,"\t",t1)
#'''